In [4]:
import pandas as pd
from io import StringIO

In [4]:
import pandas as pd
from io import StringIO

In [4]:
import pandas as pd
from io import StringIO

In [52]:
# Reading json file with the url

df2 = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data', header=None)
df2.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [53]:
# convert Json to csv

df2.to_csv('wine.csv')

In [55]:
# convert the object to a JSON string.

data = df1.to_json()
data

'{"employee_name":{"0":"James","1":"Sophia"},"email":{"0":"james@gmail.com","1":"sophia@gmail.com"},"job_profile":{"0":[{"title1":"Team Lead","title2":"Sr. Developer"}],"1":[{"title1":"Project Manager","title2":"Product Owner"}]}}'

In [56]:
type(data)

str

In [57]:
# There is an attribute called 'orient' which indicate the expected JSON format.

In [58]:
df1.to_json(orient="records")

'[{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]},{"employee_name":"Sophia","email":"sophia@gmail.com","job_profile":[{"title1":"Project Manager","title2":"Product Owner"}]}]'

In [59]:
df1.to_json(orient="split")

'{"columns":["employee_name","email","job_profile"],"index":[0,1],"data":[["James","james@gmail.com",[{"title1":"Team Lead","title2":"Sr. Developer"}]],["Sophia","sophia@gmail.com",[{"title1":"Project Manager","title2":"Product Owner"}]]]}'

In [60]:
df1.to_json(orient="index")

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]},"1":{"employee_name":"Sophia","email":"sophia@gmail.com","job_profile":[{"title1":"Project Manager","title2":"Product Owner"}]}}'

In [61]:
df1.to_json(orient="columns")

'{"employee_name":{"0":"James","1":"Sophia"},"email":{"0":"james@gmail.com","1":"sophia@gmail.com"},"job_profile":{"0":[{"title1":"Team Lead","title2":"Sr. Developer"}],"1":[{"title1":"Project Manager","title2":"Product Owner"}]}}'

In [62]:
df1.to_json(orient="values")

'[["James","james@gmail.com",[{"title1":"Team Lead","title2":"Sr. Developer"}]],["Sophia","sophia@gmail.com",[{"title1":"Project Manager","title2":"Product Owner"}]]]'

In [63]:
df1.to_json(orient="table")

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"employee_name","type":"string"},{"name":"email","type":"string"},{"name":"job_profile","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]},{"index":1,"employee_name":"Sophia","email":"sophia@gmail.com","job_profile":[{"title1":"Project Manager","title2":"Product Owner"}]}]}'

In [66]:
## Read HTML Content

In [71]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'

df3 = pd.read_html(url)
type(df3)

list

In [72]:
df3[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535

In [90]:
url = 'https://en.wikipedia.org/wiki/Mobile_country_code'

# Match  means it search for the particular keyword we provided is present in the table

df4 = pd.read_html(url, match='MNC', header=0)
df4[0]

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test network,Operational,any,NaN
1,1,1,TEST,Test network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"

In [84]:
df5 = pd.read_html(url, match='Country', header=0)
df5[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [94]:
# Reading excel files

In [96]:
df_excel = pd.read_excel('Excel_Sample.xlsx')
df_excel

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## Pickling
All pandas objects are equipped with to_pickle methods which use Python’s cPickle module to save data structures to disk using the pickle format.

In [100]:
df_excel.to_pickle('df_excel')

In [101]:
df=pd.read_pickle('df_excel')

In [102]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15